[
  {
    "id": 1,
    "translations": {
      "ar": {
        "sanad": "عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ",
        "matn": "سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \"إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ\".",
        "rawi": "رواه البخاري ومسلم"
      },
      "fr": {
        "sanad": "Le prince des croyants, Abou Hafs, ‘Oumar ibn Al-Khattâb rapporte avoir entendu le Messager d’Allah dire",
        "matn": "Les actes ne valent que par leurs intentions, et chacun sera récompensé selon son intention. Quiconque aura émigré pour Allah et Son Messager, son émigration sera pour Allah et Son Messager ; et quiconque aura émigré pour un but terrestre qu’il convoite ou pour une femme qu’il veut épouser, son émigration sera pour ce pour quoi il a émigré.",
        "rawi": "Rapporté par Al-Boukhâri et Mouslim"
      },
      "en": {
        "sanad": "Narrated by the Commander of the Believers, Abu Hafs 'Umar ibn Al-Khattab, who said: I heard the Messenger of Allah (ﷺ) say",
        "matn": "Actions are judged by intentions, and each person will have what they intended. So whoever’s migration was to Allah and His Messenger, his migration is to Allah and His Messenger; but whoever’s migration was for some worldly gain or to marry a woman, then his migration is to that for which he migrated.",
        "rawi": "Reported by Bukhari and Muslim"
      }
    }
  },
  {
    "id": 2,
    "translations": {
      "ar": {
        "sanad": "عن عمر رضي الله عنه أيضًا قال",
        "matn": "بَيْنَمَا نَحْنُ جُلُوسٌ عِندَ رَسُولِ اللَّهِ ﷺ ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعْرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ. حَتَّى جَلَسَ إلَى النَّبِيِّ ﷺ، فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الْإِسْلَامِ. فَقَالَ رَسُولُ اللَّهِ ﷺ: الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا. قَالَ: صَدَقْتَ. فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ! قَالَ: فَأَخْبِرْنِي عَنِ الْإِيمَانِ. قَالَ: أَنْ تُؤْمِنَ بِاللَّهِ، وَمَلَائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ. قَالَ: صَدَقْتَ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ. قَالَ: أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ. قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ. قَالَ: مَا الْمَسْؤُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ. قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا. قَالَ: أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ. ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا، ثُمَّ قَالَ: يَا عُمَرُ، أَتَدْرِي مَنِ السَّائِلُ؟ قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ.",
        "rawi": "رواه مسلم"
      },
      "fr": {
        "sanad": "‘Oumar رضي الله عنه rapporte également",
        "matn": "Alors que nous étions un jour assis en compagnie du Messager d’Allah ﷺ, se présenta à nous un homme portant des vêtements extrêmement blancs, les cheveux très noirs, et ne présentant aucune trace de voyage. Pourtant, aucun d’entre nous ne le connaissait. Il s’assit près du Prophète ﷺ, plaça ses genoux contre les siens, posa les paumes de ses mains sur ses cuisses et dit : « Ô Mouhammad, informe-moi sur l’islam. » Il répondit : « L’islam consiste à témoigner qu’il n’y a de divinité digne d’adoration qu’Allah et que Mouhammad est le Messager d’Allah, à accomplir la prière, à s’acquitter de la zakat, à jeûner durant le mois de Ramadan, et à accomplir le pèlerinage à la Maison si tu en as les moyens. » L’homme dit : « Tu as dit vrai. » Nous fûmes étonnés qu’il l’interroge et le confirme ensuite ! Il dit alors : « Informe-moi sur la foi (al-îmân). » Le Prophète ﷺ répondit : « C’est de croire en Allah, en Ses anges, en Ses livres, en Ses messagers, au Jour dernier et de croire au destin, qu’il soit favorable ou défavorable. » Il dit : « Tu as dit vrai. » Puis il dit : « Informe-moi sur l’excellence (al-ihsân). » Il répondit : « C’est d’adorer Allah comme si tu Le voyais, car si tu ne Le vois pas, Lui te voit. » Il dit : « Informe-moi sur l’Heure (la fin du monde). » Il répondit : « Celui qui est interrogé n’en sait pas plus que celui qui interroge. » Il dit : « Informe-moi alors de ses signes. » Il répondit : « Lorsque l’esclave donnera naissance à sa maîtresse, et que tu verras les va-nu-pieds, démunis, gardiens de moutons rivaliser dans la construction de hauts bâtiments. » Puis l’homme s’en alla. Je restai un moment sans bouger, puis le Prophète ﷺ me dit : « ‘Oumar ! Sais-tu qui était celui qui posait les questions ? » Je répondis : « Allah et Son Messager en savent mieux que moi. » Il dit : « C’était Jibril, venu vous enseigner votre religion. »",
        "rawi": "Rapporté par Mouslim"
      },
      "en": {
        "sanad": "Narrated also by ‘Umar رضي الله عنه",
        "matn": "While we were one day sitting with the Messenger of Allah ﷺ, there appeared before us a man whose clothes were exceedingly white and whose hair was exceedingly black. No signs of travel were seen on him, and none of us knew him. He came and sat before the Prophet ﷺ. Resting his knees against his knees and placing his hands on his thighs, he said: 'O Muhammad, tell me about Islam.' The Messenger of Allah ﷺ said: 'Islam is to testify that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, to perform the prayers, to pay the zakat, to fast during Ramadan, and to perform Hajj to the House if you are able to do so.' He said: 'You have spoken the truth.' We were amazed that he asked and then confirmed it. Then he said: 'Tell me about faith (iman).' He ﷺ replied: 'It is to believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in divine decree (qadar), both the good and the bad of it.' He said: 'You have spoken the truth.' He said: 'Tell me about ihsan.' He ﷺ replied: 'It is to worship Allah as if you see Him, for though you do not see Him, He sees you.' He said: 'Then tell me about the Hour.' He ﷺ said: 'The one questioned about it knows no better than the questioner.' He said: 'Then tell me about its signs.' He ﷺ replied: 'That the slave girl will give birth to her mistress, and that you will see the barefoot, unclothed, destitute shepherds competing in constructing tall buildings.' Then he went away. I stayed for a while. Then the Prophet ﷺ said: 'O ‘Umar, do you know who the questioner was?' I said: 'Allah and His Messenger know best.' He said: 'That was Jibril. He came to teach you your religion.'",
        "rawi": "Reported by Muslim"
      }
    }
  },
  {
    "id": 3,
    "translations": {
      "ar": {
        "sanad": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ",
        "matn": "سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: «بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ».",
        "rawi": "رواه البخاري ومسلم"
      },
      "fr": {
        "sanad": "Abou ‘Abd Ar-Rahmân ‘Abdoullah ibn ‘Oumar ibn Al-Khattâb رضي الله عنهما rapporte",
        "matn": "J’ai entendu le Messager d’Allah ﷺ dire : « L’islam repose sur cinq piliers : le témoignage qu’il n’y a de divinité en droit d’être adorée qu’Allah et que Mouhammad est le Messager d’Allah, l’accomplissement de la prière, le versement de l’aumône légale (zakât), le pèlerinage à la Maison (Kaaba) et le jeûne du mois de Ramadan. »",
        "rawi": "Rapporté par Al-Boukhâri et Mouslim"
      },
      "en": {
        "sanad": "Abdullah ibn Umar رضي الله عنهما reported",
        "matn": "I heard the Messenger of Allah ﷺ say: \"Islam has been built on five [pillars]: testifying that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, establishing the prayer, paying the zakat, making the pilgrimage to the House, and fasting in Ramadan.\"",
        "rawi": "Reported by Bukhari and Muslim"
      }
    }
  },
  {
    "id": 4,
    "translations": {
      "ar": {
        "sanad": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ",
        "matn": "حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ -وَهُوَ الصَّادِقُ الْمَصْدُوقُ-: «إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إِلَيْهِ الْمَلَكُ، فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٍّ أَمْ سَعِيدٍ. فَوَاللَّهِ الَّذِي لَا إِلَهَ غَيْرُهُ، إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، فَيَدْخُلُهَا. وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، فَيَدْخُلُهَا».",
        "rawi": "رواه البخاري ومسلم"
      },
      "fr": {
        "sanad": "Abou ‘Abd Ar-Rahmân ‘Abdoullah ibn Mas’oud رضي الله عنه a dit",
        "matn": "Le Messager d’Allah ﷺ, l’homme véridique et digne de foi, nous a affirmé : « Chacun de vous se forme dans le ventre de sa mère durant quarante jours, d’abord sous forme d’une goutte de sperme. Il devient ensuite un caillot de sang pour une période identique, puis une masse de chair pour une période similaire. C’est alors que l’ange lui est envoyé pour insuffler en lui la vie et avec ordre d’écrire quatre choses : sa subsistance, la durée de sa vie, ses œuvres et s’il sera parmi les damnés ou les bienheureux. Par Allah, en dehors de qui il n’y a pas de divinité en droit d’être adorée, il se peut que l’un d’entre vous accomplisse les œuvres des élus du Paradis au point d’en être séparé d’une simple coudée. Il est alors rattrapé par son destin et commet les actes des damnés de l’Enfer, où il entrera. De même, il se peut que l’un d’entre vous commette les actes des damnés de l’Enfer au point d’en être séparé d’une simple coudée. Il est alors rattrapé par son destin et accomplit les œuvres des élus du Paradis, où il entrera. »",
        "rawi": "Rapporté par Al-Boukhârî et Mouslim"
      },
      "en": {
        "sanad": "Abdullah ibn Mas'ud رضي الله عنه reported",
        "matn": "The Messenger of Allah ﷺ — and he is the truthful, the believed — narrated to us: “Verily the creation of each one of you is brought together in his mother’s womb for forty days in the form of a drop (nutfah), then he becomes a clot (‘alaqah) for a like period, then a morsel of flesh (mudghah) for a like period. Then there is sent to him the angel who breathes the soul into him and who is commanded with four matters: to write down his sustenance (rizq), his life span, his deeds, and whether he will be among the wretched or the blessed. By the One besides Whom there is no deity, one of you may do the deeds of the people of Paradise until there is only an arm’s length between him and it, then that which has been written overtakes him, and he acts with the deeds of the people of the Fire and thus enters it. And one of you may do the deeds of the people of the Fire until there is only an arm’s length between him and it, then that which has been written overtakes him, and he acts with the deeds of the people of Paradise and thus enters it.”",
        "rawi": "Reported by Bukhari and Muslim"
      }
    }
  }
]